import numpy as np

# Задаем матрицу P
P = np.array([
    [0.000000, 1.000000, 0.000000, 0.000000, 0.000000, 0.000000],
    [0.857143, 0.000000, 0.142857, 0.000000, 0.000000, 0.000000],
    [0.750000, 0.000000, 0.000000, 0.000000, 0.000000, 0.250000],
    [0.875000, 0.000000, 0.125000, 0.000000, 0.000000, 0.000000],
    [0.909091, 0.000000, 0.090909, 0.000000, 0.000000, 0.000000],
    [0.933333, 0.000000, 0.000000, 0.000000, 0.066667, 0.000000]
])

# Создаем вектор-столбец из единиц и вычитаем из него диагональную матрицу P
A = np.eye(P.shape[0]) - np.diagflat(P.diagonal())

# Вычисляем вектор-столбец значений a_i с помощью метода np.linalg.solve
a = np.linalg.solve(A, -P.dot(np.ones((P.shape[1], 1)))).flatten()

# Выводим значения a_i
print("Значения a_i:", a)